start/app/views/posts/index.html.erb

      <li>
        <%= link_to_unless_current User.find(facet['term']).full_name, params.merge(user_id: facet['term']) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1